Импорт данных/DataProcessors/СотрудникиФирм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>СотрудникиФирм</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Импорт данных/Catalogs/Фирмы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Фирмы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактныеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Телефон</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>16</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Импорт данных/DataProcessors/СотрудникиФирм/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПолучитьРезультатНаСервере()
	// 
	Запрос1=Новый Запрос;
	Запрос1.Текст="ВЫБРАТЬ
	              |	ФирмыКонтактныеЛица.Ссылка КАК Организация,
	              |	ФирмыКонтактныеЛица.Сотрудник КАК Сотрудник,
	              |	ФирмыКонтактныеЛица.Должность КАК Должность,
	              |	ФирмыКонтактныеЛица.Телефон КАК Телефон
	              |ИЗ
	              |	Справочник.Фирмы.КонтактныеЛица КАК ФирмыКонтактныеЛица
	              |ГДЕ
	              |	ФирмыКонтактныеЛица.Сотрудник = &Сотрудник";
	Запрос1.УстановитьПараметр("Сотрудник", Сотрудник);
	Результат1=Запрос1.Выполнить();
	Выборка=Результат1.Выгрузить();
	Результат.Загрузить(Выборка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьРезультат(Команда)
	ПолучитьРезультатНаСервере();
КонецПроцедуры
